import React from 'react';

function Terms() {

    return (
        <div className="terms">
            Отношения с владельцами сервера и администраторами: <br/>
            <br/>
            Администраторам запрещено:<br/>
            1.) Оскорбление игроков, в любых ситуациях. (На серверах и на форуме)<br/>
            2.) Нарушать правила, которые прописаны ниже.<br/>
            3.) Превышать полномочия. (Использовать админку в корыстных целях для себя)<br/>
            4.) Провоцировать игроков, оскорблять, угрожать<br/>
            5.) Запрещено банить игроков если администратор не уверен о его нарушениях.<br/>
            Любое из нарушения данных правил, может привести к снятию админа с его должности.<br/>
            <br/>
            <br/>
            Запрещается:<br/>
            1.)Неуважительное отношение к администрации сервера, как на форуме, так и в игре [Бан от 10 минут, до пожизненного]<br/>
            2.)Угрозы в адрес администрации сервера, как на форуме, так и в игре [Бан навсегда]<br/>
            3.) Запрещен обман администрации, и/или введение в заблуждение, и/или предоставление ложной информации [Бан от 15 минут до 7 суток, в особых случаях бан навсегда]<br/>
            4.) Запрещается использование ников администраторов, либо похожих на них. Так же ников которые оскорбляют чувство и достоинство других игроков(ка) [Бан от 15 минут, до 7 суток]<br/>
            5.) Запрещено пререкаться и оспаривать действия администрации. Для этого есть форум, вы можете подать жалобу в соответствующий раздел [kick, бан от 180 минут до пожизненного]<br/>
            6.) Запрещается выпрашивать какие либо бонусы у администраторов сервера (админ дай денег, админ переведи меня в другую команду) [kick, бан от 15 до 180 минут]<br/>
            7.) Запрещается оскорбления других игроков. (Предупреждение, кик, если не дошло бан на 30 минут)<br/>
            <br/>
            <br/>
            Общие правила проекта<br/>
            <br/>
            Запрещается:
            1.) Использование любого рода читов (aim, wh, sh, скриптов, и прочее вроде специальных моделей облегчающий прицеливание) [Бан навсегда]<br/>
            2.) Оскорбление игроков, флуд, реклама, троллинг, провокация конфликтов между игроками [Бан, от 15 минут, до 2 часов]<br/>
            3.)Осознанное использование ника другого игрока [Бан до 24 часов]<br/>
            <br/>
            <br/>
            Дополнительные правила к серверам<br/>
            <br/>
            <br/>
            CSDM Sentry<br/>
            Запрещается:<br/>
            1.) Опускание пушек подвешенных в воздух [Бан, от 60 минут, до 3 суток]<br/>
            2.) Нахождение на текстурах с любой целью [slap/slay, kick, бан до 180 минут]<br/>
            3.) Устанавливать пушки на текстурах, выше текстур. Устанавливать пушки таким образом, что основание пушки будет, находится на текстурах [slap/slay, kick, бан до 180 минут]<br/>
            4.) Блокирование точек респауна, при помощи пушек, либо своим игроком [slap/slay, вплоть до kick]<br/>
            5.) Запрещено устанавливать пушки и переключаться в режим выбора команды [kick, бан до 180 минут]<br/>
            6.) Слом лазеров (Если они не мешают пушкам, и не блочат точки респауна) [Slay. Если повторится: kick]<br/>
            7.) Запрещено ставить пушку в внутрь пушки другого игрока [Бан на 180 минут]<br/>
            8.) Распрыг в любой его форме [ Бан 2 часа]<br/>
            <br/>
            <br/>
            <br/>
            Publiс<br/>
            Запрещается:<br/>
            1.) Запрещается злостное камперство (slay повторится kick)<br/>
            <br/>
            _______________________________________________________________________________________<br/>
            <br/>
            Правила которые относятся к смене карт:<br/>
            <br/>
            - Количество игроков на сервере небольшое (до 15 человек), а карта большая<br/>
            - По просьбам минимум 5 игроков, согласовав с другими админами, и перед этим сделайте голосование (amx_vote сменить_карту? да нет)<br/>
            - Когда одна команда выиграла раунд, и получился сильный дисбаланс между командами ( в команде T 16 игроков,в команде CT 10 )<br/>
            <br/>
            ------------------------------------------------------------------------------------------<br/>
            Правила форума<br/>
            Запрещено:<br/>
            1.) Оскорбления участников (Бан от суток до недели)<br/>
            2.) Рекламирование других проектов (Конкурентов) (Бан от 10 дней до по вечно)<br/>
            3.) Запрещается создавать темы о политике, начинать её обсуждение.<br/>
            4.)Запрещая оскорблять игроков по национальной принадлежностях.<br/>
            5.) Запрещается провоцировать участников на начало политических споров и обсуждений.<br/>
            6.) Выкладывать анекдоты, рассказы, картинки, видео ролики, которые по своей сути будут нести призыв к выяснений на политической основе.<br/>
            <br/>
            <br/>
            Участники которые нарушат данные правила, будут блокироваться от недели до 1 месяца (В некоторых случаях удаления аккаунта со всеми сообщениями), если нарушения поступают от администратора,с него будет снята админка без разбирательств.<br/>
            <br/>
            Данные правила действуют и в игре - бан от 2часов до недели<br/>
            <br/>
            Данные правила будут проверятся жестко.<br/>
            <br/>
            Посты которые по мнениях глав админов, нарушают политику проекта будут удалятся без предупреждений! Главные администраторы оставляют за собой право удалять посты, одобрять или отказывать в набор (Групп, Администраторов и прочее а так же их снятие), блокировать и удалять аккаунты, без объяснения причин кому либо. Так как они являются руководителями проекта. И следят за его процветанием<br/>
            <br/>
            Не знания правил не освобождает от ответственности<br/>
            <br/>
            Версия правил от - 10 Июня 2015г.<br/>
            <br/>
            Правила будут обновляться       
    </div>
    );
}

export default Terms;